app/controllers/courses_controller.rb

  def index
    @courses = Course.all
---
SELECT * FROM "courses"

  def show
    @course = Course.find(params[:id])
---
SELECT * FROM "courses" WHERE ("courses"."id" = 23)

  def edit
    @course = Course.find(params[:id])
---
SELECT * FROM "courses" WHERE ("courses"."id" = 23)

  def update
    @course = Course.find(params[:id])

    respond_to do |format|
      if @course.update_attributes(params[:course])
---
SELECT * FROM "courses" WHERE ("courses"."id" = 23)
UPDATE "courses" SET "updated_at" = '2010-04-09 18:08:38', "subarea" = 'Estudo das Integrais' WHERE "id" = 23