app/controllers/subscriptions_controller.rb

  def index
    @user = current_user
    @subscriptions = @user.subscriptions
    @courses = Array.new
    @subscriptions.each do |subscription|
---
SELECT * FROM "subscriptions" WHERE ("subscriptions".user_id = 2)

  def show
    @user = current_user
    @subscription = @user.subscriptions.find(params[:id])
---
SELECT * FROM "subscriptions" WHERE ("subscriptions"."id" = 8 AND ("subscriptions".user_id = 8))

  def new
    @user = current_user
    @subscription = @user.subscriptions.build
    @course_areas = Course.find(:all, :group => 'area')
    @course = Course.find_by_id(@subscription.curso_id)
    @course = Course.first
---
SELECT * FROM "courses" WHERE ("courses"."area" = 'Ciência da Computação')
SELECT * FROM "courses" GROUP BY area

  def course_subareas
    @area = params[:area].sub("area_select=","")
    @render = ""
    @subareas = Course.find(:all, :conditions => { :area => @area}, :group => 'subarea' )
---
SELECT * FROM "courses" WHERE ("courses"."area" = 'area_select=Ciência da Computação')

  def create
    @user = current_user
    @subscription = @user.subscriptions.build(params[:subscription])
    @course = Course.find(:first, :conditions => {:nivel => params[:nivel_select],
        :area => params[:area_select], :subarea => params[:subarea_select]})
    @subscription.curso_id = @course.id
    if @subscription.save
---
INSERT INTO "subscriptions" ("outros_programas", "created_at", "orientador", "propositos", "updated_at", "bolsa_fomento", "bolsa_ime", "dados_carta_recomendacao", "inicio_pretendido", "user_id", "observacoes", "bolsas_anteriores", "trabalhar_se_aceito", "resumo_dissertacao_mestrado", "curso_id") VALUES('